app/Controllers/ControllerZanry.php

     public function loadZanry()
    {
        $genresPerpage = $this->config->genresPerpage;
        $data['zanry'] = $this->zanry->orderBy('nazev', 'asc')->paginate($genresPerpage);
---
SELECT *
FROM `zanr`
ORDER BY `nazev` ASC
 LIMIT 80
SELECT COUNT(*) AS `numrows`
FROM `zanr`