app/Controllers/ControllerHry.php

SELECT *
FROM `zanr`
---
    public function newHra()
    {
        $this->addBreadcrumb('Hry', base_url('hry'));
        $this->addBreadcrumb('Nová hra', base_url('hry/new'));
        $data['zanry'] = $this->zanry->findAll();